< Solution >



0. Command for checking status

	0.1 Check Running-config
		Router#show running-config

	0.2 Check Interface status
		Router#show ip interface brief

	0.3 Check Routing Table
		Router#show ip route





1. Router Setting (R11, R12, R13)
	1.1 Set Router hostname
		Router>enable
		Router#configure terminal
		Router(config)#hostname R11
		R11(config)#

	1.2 Set password for enable
		R11(config)#enable secret cisco

	1.3 Turn off Auto Domain lookup
		1.3.1 command:
			R11(config)#no ip domain lookup
		1.3.2
			* Escape DNS looking up message -> Ctrl + shift + 6)

	1.4 Turn off session timeout
		R11(config)#line console 0
		R11(config-line)#exec-timeout 0

	1.5 Synchronize console message
	    R11(config-line)#logging synchronous

	1.6 Set vyt
		1.6.1 Command:
			R11(config)#line vty 0 4
			R11(config-line)#no login
		1.6.2
			* "no login" means -> login without password




2. Interface Setting

	2.1 at PC (PC1, PC2, PC3)

		2.1.1 PC1 -> Desktop -> IP Configuration
			- Insert IP Address, Subnet Mask, Default Gateway values from the table above


	2.2 at Router (R11, R12, R13)

		2.2.1 FastEthernet
			- Set Interface IP
				R11(config)#interface FastEthernet 0/0
				R11(config-if)#ip address {address} {subnet mask}

			- bandwidth
				R11(config-if)#bandwidth 1024

			- (WERNNING) FastEthernet 의 encapsulation 설정
			    -> encapsulation 명령어 불가능
			    -> 이유 검색해볼것

			- Turn on interface
				R11(config-if)#no shutdown

		2.2.2 Serial
			- Set Interface IP
				R11(config)#interface serial 0/0
				R11(config-if)#ip address {address} {subnet mask}

			- bandwidth
				R11(config-if)#bandwidth 1024

			- clock rate
				R11(config-if)#clock rate 1000000
				    - clock rate ? 상황에서 줄 수 있는 가장 큰 수
					- ??????????????????????????

			- encapsulation
				R11(config-if)#encapsulation hdlc

			- Turn on interface
				R11(config-if)#no shutdown

		2.2.3 Save running-config to startup-config
			R11#copy running-config startup-config



3. Routing

	3.1 To PC ((PC1), PC2, PC3

		!! WERNNING !!
			destination network -> Use Representative IP address of target Device
			gateway address
				-> Use IP address of next router for reach destination (중간 지점의 라우터 IP)
				-> No Representative IP address,


		3.1.1 Routing
				- R11(config)#ip route {destination network - PC2} {subnet mask} {gateway address }
				- R11(config)#ip route {destination network - PC3} {subnet mask} {gateway address }
				- R11(config)#ip route {destination network - R13} {subnet mask} {gateway address }


